const data = {
    
5: { 
        letters: ['а','б','в','г','д','ж','з','и'], 
        
        'а': {
            1: ['Разг. о важном', 'Математика 305', 'Англ.яз 104', 'История 303', 'История 303', 'Технология'],
            2: ['Математика 305', 'Математика 305', 'Литература 204', 'Математика 305', 'Физкультура', 'Математика'],
            3: ['Биология 241', 'Русский 204', 'Русский 204', 'Русский 204', 'Математика 305', 'Русский'],
            4: ['Русский 204', 'Родная лит.', 'Математика 305', 'Литература 204', 'География 324', 'Литература'],
            5: ['Родной язык', 'Математика 302', 'Технология 143', 'Технология 143', 'Русский 204', '—'],
            6: ['Музыка 117', '—', 'Технология 141', 'Технология 141', 'Литература 204', '—']
        },

        'б': {
            1: ['Разг. о важном', 'Русский 204', 'Математика 305', 'География 324', 'Англ.яз 104', 'ИЗО 117'],
            2: ['Русский 204', 'Литература 204', 'Математика 305', 'Русский 204', 'Математика 305', 'Музыка 117'],
            3: ['Математика 305', 'Математика 305', 'История 303', 'Физкультура', 'Русский 204', 'Технология'],
            4: ['Литература 204', 'Англ.яз 104', 'Русский 204', 'Математика 305', 'Литература 204', 'Технология'],
            5: ['Биология 241', 'Технология', 'Технология', '—', '—', '—']
        },

        'в': {
            1: ['Разг. о важном', 'Математика 302', 'Англ.яз 104', 'Русский 204', 'История 303', 'Математика'],
            2: ['Математика 302', 'Русский 204', 'Математика 302', 'Литература 204', 'Русский 204', 'Русский'],
            3: ['Литература 204', 'Математика 302', 'Русский 204', 'География 324', 'Математика 302', 'Физкультура'],
            4: ['Русский 204', 'История 303', 'Литература 204', 'Англ.яз 104', 'Биология 241', '—'],
            5: ['Физкультура', '—', 'ИЗО 117', 'Музыка 117', '—', '—']
        },

        'г': {
            1: ['Разг. о важном', 'История 303', 'Математика 305', 'Англ.яз 104', 'Литература 204', 'ИЗО 117'],
            2: ['Математика 305', 'Русский 204', 'Русский 204', 'Математика 305', 'Математика 305', 'Русский'],
            3: ['Русский 204', 'Математика 305', 'Литература 204', 'Русский 204', 'Физкультура', 'Математика'],
            4: ['История 303', 'Литература 204', 'География 324', 'Русский 204', 'Англ.яз 104', '—'],
            5: ['Биология 241', 'Музыка 117', '—', '—', '—', '—']
        },

        'д': {
            1: ['Разг. о важном', 'Математика 302', 'Русский 205', 'История 214', 'Англ.яз 104', 'Физкультура'],
            2: ['Русский 205', 'Математика 302', 'Математика 302', 'Русский 205', 'Литература 205', 'Математика'],
            3: ['Математика 302', 'Литература 205', 'Англ.яз 104', 'Математика 302', 'Русский 205', 'Русский'],
            4: ['География 324', 'Физкультура', 'История 214', 'Биология 241', 'Музыка 117', '—'],
            5: ['ИЗО 117', '—', '—', '—', '—', '—']
        },

        'ж': {
            1: ['Разг. о важном', 'Русский 205', 'История 214', 'Математика 302', 'География 324', 'Музыка'],
            2: ['Математика 302', 'Литература 205', 'Русский 205', 'Англ.яз 104', 'Математика 302', 'Русский'],
            3: ['Англ.яз 104', 'Математика 302', 'Математика 302', 'Русский 205', 'Физкультура', 'Математика'],
            4: ['Русский 205', 'География 324', 'Литература 205', 'История 214', 'Биология 241', '—'],
            5: ['Физкультура', '—', '—', '—', '—', '—']
        },

        'з': {
            1: ['Разг. о важном', 'Математика 305', 'Русский 204', 'Англ.яз 104', 'История 303', 'Математика'],
            2: ['Русский 204', 'История 303', 'Математика 305', 'Русский 204', 'Физкультура', 'Русский'],
            3: ['Математика 305', 'Русский 204', 'Литература 204', 'Математика 305', 'Англ.яз 104', 'География'],
            4: ['Литература 204', 'Биология 241', 'География 324', 'Музыка 117', 'Русский 204', '—']
        },

        'и': {
            1: ['Разг. о важном', 'Русский 205', 'Математика 302', 'История 214', 'Англ.яз 104', 'ИЗО'],
            2: ['Математика 302', 'Математика 302', 'Русский 205', 'География 324', 'Русский 205', 'Физкультура'],
            3: ['История 214', 'Русский 205', 'Англ.яз 104', 'Литература 205', 'Математика 302', 'Математика'],
            4: ['Физкультура', 'Литература 205', 'Биология 241', 'Математика 302', 'Музыка 117', '—']
        }
    },
        
        6: { 
        letters: ['а','б','в','г','д','е','з','и'], 
        
        'а': {
            1: ['Разг. о важном', 'География 118', 'Математика 302', 'Русский 205', 'История 214', 'Англ.яз 104'],
            2: ['Математика 302', 'Русский 205', 'Литература 205', 'Математика 302', 'Русский 205', 'Физ-ра'],
            3: ['Русский 205', 'Литература 205', 'Биология 241', 'ОДНКНР 213', 'Математика 302', 'Математика 302'],
            4: ['Технология 143', 'Физ-ра', 'Англ.яз 104', 'Технология 143', 'Музыка 117', 'Обществозн. 213'],
            5: ['Технология 143', 'Математика 302', 'Русский 205', 'Технология 143', '—', '—']
        },

        'б': {
            1: ['Разг. о важном', 'Математика 302', 'Русский 205', 'Англ.яз 104', 'Литература 205', 'История 214'],
            2: ['Русский 205', 'География 118', 'Математика 302', 'Русский 205', 'Математика 302', 'Физ-ра'],
            3: ['Математика 302', 'Русский 205', 'История 214', 'Математика 302', 'Русский 205', 'Математика 302'],
            4: ['Физ-ра', 'Англ.яз 104', 'Музыка 117', 'ОДНКНР 213', 'Литература 205', '—'],
            5: ['Биология 241', '—', '—', '—', '—', '—']
        },

        'в': {
            1: ['Разг. о важном', 'Русский 205', 'Математика 302', 'Англ.яз 104', 'История 214', 'Математика'],
            2: ['Математика 302', 'Математика 302', 'Русский 205', 'Русский 205', 'Математика 302', 'Русский'],
            3: ['История 214', 'Русский 205', 'Литература 205', 'География 118', 'Русский 205', 'Физ-ра'],
            4: ['Русский 205', 'Биология 241', 'Физ-ра', 'Математика 302', 'Англ.яз 104', '—'],
            5: ['Музыка 117', '—', '—', '—', '—', '—']
        },

        'г': {
            1: ['Разг. о важном', 'Математика 302', 'Русский 205', 'История 214', 'Англ.яз 104', 'Биология'],
            2: ['Русский 205', 'История 214', 'Математика 302', 'Русский 205', 'Математика 302', 'Русский'],
            3: ['Математика 302', 'Русский 205', 'География 118', 'Математика 302', 'Физ-ра', 'Математика'],
            4: ['Англ.яз 104', 'Литература 205', 'Биология 241', 'ОДНКНР 213', 'Музыка 117', '—'],
            5: ['Физ-ра', '—', '—', '—', '—', '—']
        },

        'д': {
            1: ['Разг. о важном', 'Русский 301', 'Математика 305', 'История 303', 'Англ.яз 104', 'География'],
            2: ['Математика 305', 'Математика 305', 'Русский 301', 'Русский 301', 'Математика 305', 'Русский'],
            3: ['Русский 301', 'Литература 301', 'История 303', 'Математика 305', 'Русский 301', 'Физ-ра'],
            4: ['Биология 241', 'Англ.яз 104', 'Физ-ра', 'Музыка 117', 'Литература 301', '—']
        },

        'е': {
            1: ['Разг. о важном', 'Математика 305', 'Русский 301', 'Англ.яз 104', 'История 303', 'Математика'],
            2: ['Русский 301', 'Математика 305', 'Математика 305', 'Русский 301', 'Математика 305', 'Русский'],
            3: ['Англ.яз 104', 'Русский 301', 'Биология 241', 'История 303', 'Физ-ра', 'Математика'],
            4: ['Математика 305', 'География 118', 'Музыка 117', 'Литература 301', 'Русский 301', '—']
        },

        'з': {
            1: ['Разг. о важном', 'Русский 301', 'История 303', 'Математика 305', 'Англ.яз 104', 'Физ-ра'],
            2: ['Математика 305', 'Русский 301', 'Математика 305', 'Русский 301', 'Математика 305', 'Русский'],
            3: ['География 118', 'Математика 305', 'Англ.яз 104', 'Биология 241', 'Русский 301', 'Математика'],
            4: ['Русский 301', 'Физ-ра', 'История 303', 'Литература 301', 'Музыка 117', '—']
        },

        'и': {
            1: ['Разг. о важном', 'История 303', 'Математика 305', 'Русский 301', 'Англ.яз 104', 'География'],
            2: ['Русский 301', 'Математика 305', 'Русский 301', 'Математика 305', 'Математика 305', 'Русский'],
            3: ['Математика 305', 'Русский 301', 'История 303', 'Англ.яз 104', 'Физ-ра', 'Математика'],
            4: ['Физ-ра', 'Литература 301', 'Биология 241', 'Русский 301', 'Музыка 117', '—']
        }
    },
    
7: { 
        letters: ['а','б','в','г','д','е','ж','з'], 
        
        'а': {
            1: ['Разг. о важном', 'Физика 342', 'Алгебра 305', 'Русский 301', 'История 214', 'Англ.яз 104'],
            2: ['Алгебра 305', 'Русский 301', 'Литература 301', 'Алгебра 305', 'Геометрия 305', 'Физика 342'],
            3: ['География 324', 'Алгебра 305', 'Физика 342', 'Биология 241', 'Русский 301', 'Физ-ра'],
            4: ['Англ.яз 104', 'История 214', 'Русский 301', 'Геометрия 305', 'Информатика', 'Общ-во 213'],
            5: ['Литература 301', 'Физ-ра', 'Музыка 117', 'Технология', 'География 324', '—']
        },

        'б': {
            1: ['Разг. о важном', 'Алгебра 305', 'Физика 342', 'География 324', 'Русский 301', 'История 214'],
            2: ['География 324', 'Физика 342', 'Русский 301', 'Литература 301', 'Алгебра 305', 'Англ.яз 104'],
            3: ['Русский 301', 'История 214', 'Алгебра 305', 'Физ-ра', 'Геометрия 305', 'Физика 342'],
            4: ['Алгебра 305', 'Русский 301', 'Биология 241', 'Англ.яз 104', 'Музыка 117', 'Информатика'],
            5: ['Физ-ра', 'Литература 301', 'Общ-во 213', 'Технология', '—', '—']
        },

        'в': {
            1: ['Разг. о важном', 'Русский 301', 'Алгебра 305', 'Физика 342', 'Геометрия 305', 'История'],
            2: ['Физика 342', 'География 324', 'История 214', 'Русский 301', 'Алгебра 305', 'Физ-ра'],
            3: ['Алгебра 305', 'Русский 301', 'Англ.яз 104', 'Литература 301', 'Физика 342', 'Русский'],
            4: ['Геометрия 305', 'Биология 241', 'Музыка 117', 'Англ.яз 104', 'Физ-ра', '—']
        },

        'г': {
            1: ['Разг. о важном', 'История 214', 'География 324', 'Алгебра 305', 'Русский 301', 'Физика'],
            2: ['Русский 301', 'Физика 342', 'Алгебра 305', 'Геометрия 305', 'Литература 301', 'Алгебра'],
            3: ['Физика 342', 'Алгебра 305', 'Русский 301', 'Англ.яз 104', 'История 214', 'Физ-ра'],
            4: ['Физ-ра', 'Литература 301', 'Биология 241', 'Музыка 117', 'Англ.яз 104', '—']
        },

        'д': {
            1: ['Разг. о важном', 'Алгебра 315', 'Русский 203', 'История 214', 'Физика 340', 'География'],
            2: ['Физика 340', 'Литература 203', 'Алгебра 315', 'Геометрия 315', 'Русский 203', 'Алгебра'],
            3: ['Русский 203', 'Геометрия 315', 'История 214', 'Англ.яз 104', 'Физ-ра', 'Русский'],
            4: ['Биология 239', 'Англ.яз 104', 'Физ-ра', 'Музыка 117', 'Литература 203', '—']
        },

        'е': {
            1: ['Разг. о важном', 'Русский 203', 'Физика 340', 'Алгебра 315', 'История 214', 'Физ-ра'],
            2: ['География 118', 'Алгебра 315', 'История 214', 'Русский 203', 'Физика 340', 'Русский'],
            3: ['Алгебра 315', 'Физика 340', 'Русский 203', 'Биология 239', 'Англ.яз 104', 'Алгебра'],
            4: ['Англ.яз 104', 'Физ-ра', 'Литература 203', 'Музыка 117', 'Геометрия 315', '—']
        },

        'ж': {
            1: ['Разг. о важном', 'История 214', 'Русский 203', 'География 118', 'Алгебра 315', 'Физика'],
            2: ['Алгебра 315', 'Физика 340', 'Геометрия 315', 'История 214', 'Русский 203', 'Алгебра'],
            3: ['Физика 340', 'Русский 203', 'Алгебра 315', 'Англ.яз 104', 'Литература 203', 'Русский'],
            4: ['Литература 203', 'Биология 239', 'Физ-ра', 'Англ.яз 104', 'Музыка 117', '—']
        },

        'з': {
            1: ['Разг. о важном', 'Физика 340', 'Алгебра 315', 'Русский 203', 'История 214', 'География'],
            2: ['Русский 203', 'География 118', 'История 214', 'Физика 340', 'Алгебра 315', 'Физ-ра'],
            3: ['Геометрия 315', 'Алгебра 315', 'Англ.яз 104', 'Русский 203', 'Биология 239', 'Русский'],
            4: ['Физ-ра', 'Англ.яз 104', 'Литература 203', 'Музыка 117', 'Физика 340', '—']
        }
    },
8: { 
        letters: ['а', 'б','в','г','д','е','ж','и','к','л'], 
        
        'а': {
            1: ['Разг. о важном', 'Химия 242', 'Алгебра 315', 'Физика 340', 'Русский 203', 'География 118'],
            2: ['Алгебра 315', 'Русский 203', 'Геометрия 315', 'Биология 239', 'Алгебра 315', 'История 214'],
            3: ['Физика 340', 'Литература 203', 'История 214', 'Алгебра 315', 'Англ.яз 104', 'Химия 242'],
            4: ['Русский 203', 'Физкультура', 'Общество 213', 'Русский 203', 'Геометрия 315', 'Физкультура'],
            5: ['Биология 239', 'Англ.яз 104', 'Русский 203', 'Литература 203', 'География 118', '—']
        },

        'б': {
            1: ['Разг. о важном', 'Русский 203', 'Химия 242', 'Алгебра 305', 'География 118', 'История 214'],
            2: ['География 118', 'Алгебра 305', 'Русский 203', 'Физика 340', 'Англ.яз 104', 'Алгебра 305'],
            3: ['Алгебра 305', 'Химия 242', 'Физкультура', 'Русский 203', 'Литература 203', 'Биология 239'],
            4: ['История 214', 'Литература 203', 'Алгебра 305', 'Геометрия 305', 'Физика 340', '—'],
            5: ['Англ.яз 104', 'Биология 239', 'Литература 203', 'Физкультура', 'Русский 203', '—']
        },

        'в': {
            1: ['Разг. о важном', 'Алгебра 315', 'Физика 340', 'Русский 203', 'Химия 242', 'История'],
            2: ['Русский 203', 'Химия 242', 'Алгебра 315', 'География 118', 'Физкультура', 'Алгебра'],
            3: ['Физика 340', 'Русский 203', 'Геометрия 315', 'Англ.яз 104', 'Алгебра 315', 'Русский'],
            4: ['Биология 239', 'Литература 203', 'История 214', 'Англ.яз 104', 'Геометрия 315', '—']
        },

        'г': {
            1: ['Разг. о важном', 'Физика 340', 'Русский 203', 'Алгебра 315', 'История 214', 'Химия'],
            2: ['Химия 242', 'Алгебра 315', 'География 118', 'Русский 203', 'Алгебра 315', 'Физкультура'],
            3: ['Русский 203', 'Геометрия 315', 'Физика 340', 'Англ.яз 104', 'Биология 239', 'Русский'],
            4: ['Геометрия 315', 'История 214', 'Англ.яз 104', 'Литература 203', 'Физкультура', '—']
        },

        'д': {
            1: ['Разг. о важном', 'Русский 201', 'Алгебра 302', 'Физика 342', 'Химия 242', 'География'],
            2: ['Алгебра 302', 'Физика 342', 'Русский 201', 'История 214', 'Физкультура', 'Алгебра'],
            3: ['Химия 242', 'Русский 201', 'Геометрия 315', 'Англ.яз 104', 'Алгебра 302', 'Русский'],
            4: ['История 214', 'Биология 239', 'Англ.яз 104', 'Литература 201', 'Геометрия 315', '—']
        },

        'е': {
            1: ['Разг. о важном', 'Физика 342', 'Химия 242', 'Русский 201', 'Алгебра 302', 'История'],
            2: ['Русский 201', 'Алгебра 302', 'Физика 342', 'География 118', 'Алгебра 302', 'Физкультура'],
            3: ['Алгебра 302', 'Геометрия 315', 'Русский 201', 'Англ.яз 104', 'Химия 242', 'Русский'],
            4: ['Биология 239', 'Англ.яз 104', 'История 214', 'Литература 201', 'Физкультура', '—']
        },

        'ж': {
            1: ['Разг. о важном', 'Химия 242', 'Русский 201', 'Алгебра 302', 'Физика 342', 'География'],
            2: ['Физика 342', 'Алгебра 302', 'История 214', 'Химия 242', 'Русский 201', 'Алгебра'],
            3: ['Русский 201', 'Англ.яз 104', 'Алгебра 302', 'Геометрия 315', 'Физкультура', 'Русский'],
            4: ['Геометрия 315', 'Биология 239', 'Англ.яз 104', 'Литература 201', 'История 214', '—']
        },

        'и': {
            1: ['Разг. о важном', 'Алгебра 302', 'Физика 342', 'Русский 201', 'География 118', 'Химия'],
            2: ['Химия 242', 'Русский 201', 'Алгебра 302', 'Физкультура', 'Алгебра 302', 'История'],
            3: ['Физика 342', 'История 214', 'Англ.яз 104', 'Русский 201', 'Геометрия 315', 'Русский'],
            4: ['Биология 239', 'Геометрия 315', 'Англ.яз 104', 'Литература 201', 'Физкультура', '—']
        },

        'к': {
            1: ['Разг. о важном', 'Русский 205', 'Химия 242', 'Физика 340', 'Алгебра 315', 'География'],
            2: ['Алгебра 315', 'Физика 340', 'Русский 205', 'История 214', 'Физкультура', 'Алгебра'],
            3: ['Химия 242', 'Алгебра 315', 'Геометрия 315', 'Англ.яз 104', 'Русский 205', 'Русский'],
            4: ['История 214', 'Биология 241', 'Англ.яз 104', 'Литература 205', 'Геометрия 315', '—']
        },

        'л': {
            1: ['Разг. о важном', 'Физика 340', 'Алгебра 315', 'Русский 205', 'Химия 242', 'История'],
            2: ['Русский 205', 'Химия 242', 'Физика 340', 'География 118', 'Алгебра 315', 'Физкультура'],
            3: ['Алгебра 315', 'Геометрия 315', 'Русский 205', 'Англ.яз 104', 'Физика 340', 'Русский'],
            4: ['Биология 241', 'Англ.яз 104', 'История 214', 'Литература 205', 'Физкультура', '—']
        }
    },

    9: { 
        letters: ['а','б','в','г','д','е','ж'], 
        
        'а': {
            1: ['ОБЖ 119', 'Биология 239', 'Физика 340', 'Алгебра 315', 'Алгебра 315', 'Русский 201'],
            2: ['Родной язык', 'История 214', 'Физ-ра', 'Химия 242', 'Физика 342', 'Алгебра 315'],
            3: ['География 118', 'Разг. о важном', 'Алгебра 315', 'Русский 201', 'Англ.яз 104', 'Геометрия 315'],
            4: ['Англ.яз 104', 'Алгебра 315', 'Химия 242', 'Русский 201', 'География 118', 'Химия 242'],
            5: ['Алгебра 315', 'Родная лит.', 'Русский 201', 'Вер. и стат. 315', 'Литература 201', '—'],
            6: ['Физ-ра', 'Геометрия 315', 'Геометрия 315', 'Литература 201', 'Информатика', '—']
        },

        'б': {
            1: ['Химия 242', 'Алгебра 302', 'Физика 340', 'Русский 201', 'История 214', 'Физ-ра'],
            2: ['Алгебра 302', 'Русский 201', 'Биология 239', 'География 118', 'Алгебра 302', 'Русский 201'],
            3: ['Русский 201', 'Разг. о важном', 'Геометрия 315', 'Алгебра 302', 'Англ.яз 104', 'Геометрия 315'],
            4: ['География 118', 'Геометрия 315', 'Русский 201', 'Химия 242', 'Физика 340', '—'],
            5: ['Англ.яз 104', 'Физ-ра', 'Информатика', 'Общество 213', 'Литература 201', '—']
        },

        'в': {
            1: ['Разг. о важном', 'Алгебра 315', 'Русский 201', 'География 118', 'Физика 340', 'Алгебра'],
            2: ['Физика 340', 'Геометрия 315', 'Химия 242', 'Алгебра 315', 'Русский 201', 'Русский'],
            3: ['Алгебра 315', 'Русский 201', 'История 214', 'Англ.яз 104', 'Биология 239', 'Физ-ра'],
            4: ['Англ.яз 104', 'Химия 242', 'Физ-ра', 'Геометрия 315', 'Общество 213', '—']
        },

        'г': {
            1: ['Разг. о важном', 'Русский 201', 'Алгебра 315', 'Физика 340', 'История 214', 'География'],
            2: ['География 118', 'Алгебра 315', 'Русский 201', 'Физика 340', 'Химия 242', 'Алгебра'],
            3: ['Химия 242', 'История 214', 'Англ.яз 104', 'Русский 201', 'Физ-ра', 'Русский'],
            4: ['Физ-ра', 'Геометрия 315', 'Биология 239', 'Англ.яз 104', 'Общество 213', '—']
        },

        'д': {
            1: ['Разг. о важном', 'Алгебра 302', 'Физика 342', 'Русский 201', 'Химия 242', 'История'],
            2: ['Русский 201', 'Химия 242', 'Алгебра 302', 'География 118', 'Физика 342', 'Алгебра'],
            3: ['Физика 342', 'География 118', 'Англ.яз 104', 'Русский 201', 'История 214', 'Русский'],
            4: ['Англ.яз 104', 'Физ-ра', 'Биология 239', 'Геометрия 315', 'Физ-ра', '—']
        },

        'е': {
            1: ['Разг. о важном', 'Русский 205', 'Алгебра 302', 'Физика 342', 'История 303', 'География'],
            2: ['Алгебра 302', 'Физика 342', 'Русский 205', 'Химия 242', 'Алгебра 302', 'Физ-ра'],
            3: ['История 303', 'Англ.яз 104', 'Химия 242', 'Русский 205', 'Геометрия 305', 'Русский'],
            4: ['География 324', 'Биология 241', 'Физ-ра', 'Англ.яз 104', 'Информатика', '—']
        },

        'ж': {
            1: ['Разг. о важном', 'Физика 342', 'Русский 205', 'Алгебра 302', 'География 324', 'История'],
            2: ['Русский 205', 'Алгебра 302', 'История 303', 'Физика 342', 'Химия 242', 'Алгебра'],
            3: ['Химия 242', 'География 324', 'Англ.яз 104', 'Русский 205', 'Физ-ра', 'Русский'],
            4: ['Физ-ра', 'Англ.яз 104', 'Биология 241', 'Геометрия 305', 'Общество 213', '—']
        }
    },

    10: { 
        letters: ['а','б','в'], 
        
        'а': {
            1: ['Общество 213', 'Алгебра 302', 'Алгебра 302', 'Алгебра 302', 'Физ-ра', 'Лит-ра 205'],
            2: ['Русский 201', 'Физ-ра', 'Геометрия 315', 'Литература 201', 'История 214', 'Алгебра 302'],
            3: ['География 118', 'Химия 242', 'История 214', 'Геометрия 315', 'Англ.яз 104', 'Химия 242'],
            4: ['Физика 342', 'Биология 239', 'Литература 205', 'Русский 201', 'Физика 342', 'ОБЖ 119'],
            5: ['Электив Матем.', 'Англ.яз 104', 'Право 213', 'Проект', 'Информатика', '—'],
            6: ['Информатика', '—', '—', '—', '—', '—']
        },

        'б': {
            1: ['Разг. о важном', 'Алгебра 302', 'Русский 201', 'Физика 342', 'История 214', 'Химия'],
            2: ['Геометрия 315', 'Русский 201', 'Алгебра 302', 'Физ-ра', 'Геометрия 315', 'Алгебра'],
            3: ['Физика 342', 'Англ.яз 104', 'История 214', 'Литература 201', 'Русский 201', 'Биология'],
            4: ['Химия 242', 'География 118', 'Англ.яз 104', 'Общество 213', 'Физ-ра', '—']
        },

        'в': {
            1: ['Разг. о важном', 'Русский 201', 'Физика 342', 'Алгебра 302', 'Геометрия 315', 'История'],
            2: ['Алгебра 302', 'История 214', 'Русский 201', 'Биология 239', 'Алгебра 302', 'Физ-ра'],
            3: ['Геометрия 315', 'Физика 342', 'Англ.яз 104', 'Химия 242', 'Русский 201', 'Общество'],
            4: ['Англ.яз 104', 'География 118', 'Физ-ра', 'Литература 201', '—', '—']
        }
    },

    11: { 
        letters: ['а','б','в'], 
        
        'а': {
            1: ['Разг. о важном', 'Русский 201', 'Физика 342', 'Родной язык', 'Алгебра 302', 'Общество 213'],
            2: ['Физ-ра', 'Англ.яз 104', 'Геометрия 315', 'Родная лит.', 'Физика 342', 'История 214'],
            3: ['Русский 201', 'География 118', 'Статистика 315', 'Алгебра 315', 'Англ.яз 104', 'Алгебра 315'],
            4: ['Право 213', 'Проект', 'Общество 213', 'Химия 242', 'География 248', 'Биология 239'],
            5: ['Алгебра 315', 'Англ.яз 104', 'Литература 205', 'Литература 205', '—', '—'],
            6: ['Геометрия 315', 'Русский 201', 'Русский 201', 'ОБЖ 119', '—', '—']
        },

        'б': {
            1: ['Разг. о важном', 'Алгебра 315', 'Русский 201', 'Физика 342', 'Общество 213', 'История'],
            2: ['История 214', 'Геометрия 315', 'Англ.яз 104', 'Алгебра 315', 'Русский 201', 'Физ-ра'],
            3: ['Физика 342', 'Русский 201', 'Литература 205', 'Геометрия 315', 'Биология 239', 'Русский'],
            4: ['Англ.яз 104', 'Химия 242', 'Физ-ра', 'Литература 205', '—', '—']
        },

        'в': {
            1: ['Разг. о важном', 'Русский 201', 'История 214', 'Алгебра 315', 'География 118', 'Физика'],
            2: ['Алгебра 315', 'Физика 342', 'Русский 201', 'Общество 213', 'Англ.яз 104', 'Физ-ра'],
            3: ['Геометрия 315', 'Англ.яз 104', 'Биология 239', 'Геометрия 315', 'Русский 201', 'Алгебра'],
            4: ['Литература 205', 'Физ-ра', 'Химия 242', 'Русский 201', '—', '—']
        }
    }
}; 

function showClasses(num) {
    document.getElementById('step1').classList.add('hidden');
    document.getElementById('step2').classList.remove('hidden');
    document.getElementById('parallel-label').innerText = `${num}-е классы`;
    
    const container = document.getElementById('class-buttons');
    container.innerHTML = '';

    const currentData = data[num] || { letters: [] };
    
    currentData.letters.forEach(l => {
        const b = document.createElement('button');
        b.className = 'btn c-btn';
        b.innerText = num + l.toUpperCase(); 
        b.onclick = () => showTable(num, l);
        container.appendChild(b);
    });
}

function getScheduleByDays(parallel, letter) {
    const classData = data[parallel][letter];
    const days = [[], [], [], [], [], []]; 

    for (let hour in classData) {
        classData[hour].forEach((lesson, dayIndex) => {
            if (lesson && lesson !== '—' && lesson !== '-' && dayIndex < 6) {
                days[dayIndex].push(`${hour}. ${lesson}`);
            }
        });
    }
    return days;
}

function showTable(parallel, letter) {
    document.getElementById('step2').classList.add('hidden');
    document.getElementById('step3').classList.remove('hidden');
    
    document.getElementById('current-class-label').innerText = `Класс ${parallel} "${letter.toUpperCase()}"`;
    
    const scheduleContainer = document.getElementById('schedule-container');
    const daysNames = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'];

    const mySchedule = getScheduleByDays(parallel, letter);

    let html = '';
    mySchedule.forEach((lessons, index) => {
        if (lessons.length > 0) {
            html += `
                <div class="day-card">
                    <h3>${daysNames[index]}</h3>
                    <ul>
                        ${lessons.map(u => `<li>${u}</li>`).join('')}
                    </ul>
                </div>
            `;
        }
    });

    scheduleContainer.innerHTML = html;
}

function goBack(step) {
    if(step === 1) {
        document.getElementById('step2').classList.add('hidden');
        document.getElementById('step1').classList.remove('hidden');
    } else if (step === 2) {
        document.getElementById('step3').classList.add('hidden');
        document.getElementById('step2').classList.remove('hidden');
    }
}

function showHolidays() {
    document.getElementById('main-step').classList.add('hidden');
    document.getElementById('step4').classList.remove('hidden');
    
    document.getElementById('holiday-title').innerText = "Каникулы 2025-2026";
    
    const holidays = [
        { name: "Осенние", date: "27 окт — 4 ноя" },
        { name: "Зимние", date: "29 дек — 11 янв" },
        { name: "Весенние", date: "23 мар — 31 мар" },
        { name: "Летние", date: "1 июня — 31 авг" }
    ];

    let html = "<ul>";
    holidays.forEach(h => {
        html += `
            <li class="holiday-list-item">
                <span class="holiday-name">${h.name}</span>
                <span class="holiday-date">${h.date}</span>
            </li>`;
    });
    html += "</ul>";

    document.getElementById('holiday-content').innerHTML = html;
    document.getElementById('holiday-note').innerText = "* Даты могут быть изменены по решению администрации школы №25.";
}

function goHome() {
    document.getElementById('step4').classList.add('hidden');
    document.getElementById('main-step').classList.remove('hidden');
}